project/integrations/IMPORT_CUSTOMERS_01.00.0000/resources/application_242/inbound_243/resourcegroup_244/createCustomer_REQUEST_RT.wsdl

<wsdl:definitions         targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/createCustomer_REQUEST"     xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"     xmlns:errors="http://xmlns.oracle.com/adf/svc/errors/"     xmlns:orafault="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0"     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"     xmlns:tns="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/"     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"     xmlns:types="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/"     xmlns:ns0="http://xmlns.oracle.com/cloud/adapter/erp/createCustomer_REQUEST/types"     xmlns:ns1="http://xmlns.oracle.com/cloud/adapter/erp/createCustomer_REQUEST"    >    <casdk:RuntimeIntegrationModel xmlns:casdk="http://xml.oracle.com/wsdl/extensions">        <casdk:sourceWSDLMetadata>            <casdk:serviceName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/}OrganizationService</casdk:serviceName>            <casdk:portTypeName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/}OrganizationService</casdk:portTypeName>            <casdk:portName>OrganizationServiceSoapHttpPort</casdk:portName>            <casdk:endpointURL>ENDPOINT_URL</casdk:endpointURL>            <casdk:targetWSDLNS>http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/</casdk:targetWSDLNS>            <casdk:soapVersion>SOAP11</casdk:soapVersion>        </casdk:sourceWSDLMetadata>    </casdk:RuntimeIntegrationModel>    <plnk:partnerLinkType name="createOrganization_plt">        <plnk:role name="createOrganization_role">            <plnk:portType name="ns1:createCustomer_REQUESTPortType"/>        </plnk:role>    </plnk:partnerLinkType>    <wsdl:types>        <xs:schema xmlns="http://xmlns.oracle.com/cloud/adapter/erp/createCustomer_REQUEST/types"             elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/createCustomer_REQUEST/types">            <xs:element name="createOrganization" type="xs:anyType"/>            <xs:element name="createOrganizationResponse" type="xs:anyType"/>        </xs:schema>        <xs:schema xmlns="http://xmlns.oracle.com/adf/svc/errors/" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/adf/svc/errors/">            <xs:element name="ServiceErrorMessage" type="xs:anyType"/>        </xs:schema>    </wsdl:types>    <wsdl:message name="createOrganizationRequestMessage">        <wsdl:part name="parameters" element="ns0:createOrganization"/>    </wsdl:message>    <wsdl:message name="createOrganizationResponseMessage">        <wsdl:part name="parameters" element="ns0:createOrganizationResponse"/>    </wsdl:message>    <wsdl:message name="ServiceException">        <wsdl:part name="parameters" element="errors:ServiceErrorMessage"/>    </wsdl:message>    <wsdl:portType name="createCustomer_REQUESTPortType">        <wsdl:operation name="createOrganization">            <cloud:CloudOperation xmlns:cloud="http://xml.oracle.com/types" targetOperation="createOrganization"/>            <wsdl:input message="ns1:createOrganizationRequestMessage"/>            <wsdl:output message="ns1:createOrganizationResponseMessage"/>            <wsdl:fault name="ServiceException" message="ns1:ServiceException"/>        </wsdl:operation>    </wsdl:portType></wsdl:definitions>