NetSuiteWebhook/NetSuiteWebhook/Files/NS_FU/Fusion/Organization/Create/Request/BeforeOverall/CreateOrganization.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/">
		<ns1:createOrganization>
			<ns1:organizationParty xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/">
				<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
				<ns2:OrganizationProfile>
					<ns2:PartyNumber>Test10_1</ns2:PartyNumber>
					<ns2:OrganizationName>Department of Social Services</ns2:OrganizationName>
					<ns2:JgzzFiscalCode>ABPBC4545Z</ns2:JgzzFiscalCode>
					<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
				</ns2:OrganizationProfile>
				<ns2:PartyUsageAssignment xmlns:ns5="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
					<ns5:PartyUsageCode>PARTY_OF_INTEREST</ns5:PartyUsageCode>
					<ns5:EffectiveStartDate>2021-02-10</ns5:EffectiveStartDate>
					<ns5:CreatedByModule>SIS</ns5:CreatedByModule>
				</ns2:PartyUsageAssignment>
				<ns2:PartySite xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
					<ns6:LocationId>300000003167472</ns6:LocationId>
					<ns6:PartySiteNumber>Test1002</ns6:PartySiteNumber>
					<ns6:PartySiteName>TestPartySite10_1</ns6:PartySiteName>
					<ns6:StartDateActive>2021-07-28</ns6:StartDateActive>
					<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					<ns6:PartySiteUse>
						<ns6:SiteUseType>BILL_TO</ns6:SiteUseType>
						<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					</ns6:PartySiteUse>
					<ns6:PartySiteUse>
						<ns6:SiteUseType>SHIP_TO</ns6:SiteUseType>
						<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					</ns6:PartySiteUse>
				</ns2:PartySite>
				<ns2:PartySite xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
					<ns6:LocationId>300000003167491</ns6:LocationId>
					<ns6:PartySiteNumber>Test1002_1</ns6:PartySiteNumber>
					<ns6:PartySiteName>TestPartySite10_1</ns6:PartySiteName>
					<ns6:StartDateActive>2021-07-28</ns6:StartDateActive>
					<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					<ns6:PartySiteUse>
						<ns6:SiteUseType>BILL_TO</ns6:SiteUseType>
						<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					</ns6:PartySiteUse>
					<ns6:PartySiteUse>
						<ns6:SiteUseType>SHIP_TO</ns6:SiteUseType>
						<ns6:CreatedByModule>SIS</ns6:CreatedByModule>
					</ns6:PartySiteUse>
				</ns2:PartySite>
			</ns1:organizationParty>
		</ns1:createOrganization>
	</soap:Body>
</soap:Envelope>
