Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/Organization/Create/Request/CreateOrganization.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:app1="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/" xmlns:ns3="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/" xmlns:app2="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/" xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/" xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:app3="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<app2:createOrganization>
			<app2:organizationParty>
				<app1:CreatedByModule>SIS</app1:CreatedByModule>
				<app1:OrganizationProfile>
					<app1:PartyNumber>D77215A</app1:PartyNumber>
					<app1:OrganizationName>SRG Global Services TEST</app1:OrganizationName>
					<app1:CreatedByModule>SIS</app1:CreatedByModule>
					<app1:JgzzFiscalCode>40111102240</app1:JgzzFiscalCode>
				</app1:OrganizationProfile>
				<app1:PartyUsageAssignment>
					<ns2:PartyUsageCode>PARTY_OF_INTEREST</ns2:PartyUsageCode>
					<ns2:EffectiveStartDate>2021-08-16</ns2:EffectiveStartDate>
					<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
				</app1:PartyUsageAssignment>
				<app1:PartySite>
					<ns2:LocationId>300000008732769</ns2:LocationId>
					<ns2:PartySiteNumber>AD7721500</ns2:PartySiteNumber>
					<ns2:PartySiteName>SRG Global Services - Default Site</ns2:PartySiteName>
					<ns2:StartDateActive>2021-08-16</ns2:StartDateActive>
					<ns2:OverallPrimaryFlag>true</ns2:OverallPrimaryFlag>
					<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
					<ns2:PartySiteUse>
						<ns2:SiteUseType>BILL_TO</ns2:SiteUseType>
						<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
					</ns2:PartySiteUse>
				</app1:PartySite>
				<app1:PartySite>
					<ns2:LocationId>300000008732771</ns2:LocationId>
					<ns2:PartySiteNumber>A2264800</ns2:PartySiteNumber>
					<ns2:PartySiteName>SRG Global Services - Melbourne Airport - Customs House (Centre Road) - A2264800</ns2:PartySiteName>
					<ns2:EffectiveStartDate>2021-08-13</ns2:EffectiveStartDate>
					<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
					<ns2:PartySiteUse>
						<ns2:SiteUseType>BILL_TO</ns2:SiteUseType>
						<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
					</ns2:PartySiteUse>
				</app1:PartySite>
			</app2:organizationParty>
		</app2:createOrganization>
	</soap:Body>
</soap:Envelope>